Repository: pkp/crossrefReferenceLinking
Catalog: locale/*/locale.po
Languages: de_de, es, fr_fr, it_it, pl_pl

# plugins.generic.crossrefReferenceLinking.displayName
source: Crossref Reference Linking
es: Vinculación de referencias Crossref
pl_pl: Linkowanie bibliografii identyfikatorami Crossref

# plugins.generic.crossrefReferenceLinking.description
source: This plugin submits article references to Crossref when a DOI is registered and automatically displays DOIs for references found in Crossref's database.
de_de: Dieses Plugin übermittelt die Referenzen der Literaturliste an Crossref sobald ein DOI registiert wird und bildet automatisch DOIs ab, die in der Crossref Datenbank gefunden werden.
es: Este módulo envía las citas del artículo a Crossref en tanto es señalado un DOI, así muestra automáticamente los DOIs de las referencias encontradas en la base de datos de Crossref.
fr_fr: Ce plugin soumet les références des articles à Crossref lorsqu'un DOI est enregistré et affiche automatiquement les DOI des références trouvées dans la base de données de Crossref.
it_it: Questo plugin invia i riferimenti degli articoli a Crossref quando un DOI è registrato e visualizza automaticamente i DOI per i riferimenti trovati nel database di Crossref.
pl_pl: Wtyczka automatycznie wysyła bibliografię artykułu do Crossref i wyświetla DOI w miejscach w których indeks wykazuje prawidłowe porównanie.

# plugins.generic.crossrefReferenceLinking.description.long
source: This plugin will automatically add the extracted article references to the DOI registration with Crossref. Crossref will then automatically check if any DOIs can be found for the submitted references. Using the scheduled task the plugin will then check for the found references DOIs.
de_de: Dieses Plugin fügt die Literaturliste zur DOI Registrierung bei Crossref hinzu. Crossref wird dann automatisch prüfen, ob DOIs in den übermittelten Referenzen gefunden werden. Ein Scheduled task wird dann die gefundenen DOI überprüfen.
fr_fr: Ce plugin ajoutera automatiquement les références d'articles extraites à l'enregistrement des DOI auprès de Crossref. Crossref vérifiera alors automatiquement si des DOIs peuvent être trouvés pour les références soumises. En utilisant la tâche planifiée, le plugin vérifiera alors les DOIs des références trouvées.
it_it: uesto plugin aggiungerà automaticamente i riferimenti degli articoli estratti alla registrazione DOI con Crossref. Crossref controllerà quindi automaticamente se è possibile trovare un DOI per i riferimenti inviati. Utilizzando l'attività programmata il plugin controllerà poi i DOI dei riferimenti trovati.
pl_pl: Ta wtyczka automatycznie doda odniesienia do wyodrębnionego artykułu zarejestrowanego uprzednio jako DOI w Crossref. Crossref automatycznie sprawdzi, czy można znaleźć jakieś DOI dla przesłanych referencji. Wkrótce potem możesz użyć wtyczki, aby wyszukać znalezione DOI referencji, albo automatycznie (jeśli odpowiednia opcja jest ustawiona we wtyczce Crossref Export) lub ręcznie na karcie metadanych przesyłania „Referencje”

# plugins.generic.crossrefReferenceLinking.description.note
source: If you change an article's references after registering the DOI, you will need to register the article's DOI again and check again for the article references' DOIs.
de_de: Sobald nach der Registrierung einer DOI, Änderungen an der Literatur gemacht werden, muss die DOi erneut registriert werden, damit die DOI Referenzen erneut geprüft werden.
es: Si cambia las referencias de un artículo después de registrar el DOI, deberá volver a registrar el DOI del artículo y verificar nuevamente los DOIs de las referencias del artículo.
fr_fr: Si vous modifiez les références d'un article après avoir enregistré le DOI, vous devrez enregistrer à nouveau le DOI de l'article et vérifier les DOI des références de l'article.
it_it: Se si cambiano i riferimenti di un articolo dopo aver registrato il DOI, è necessario registrare nuovamente il DOI dell'articolo e controllare i DOI dei riferimenti dell'articolo.
pl_pl: Jeśli zmienisz/dodasz cytowania w artykule po zarejestrowaniu jego DOI, będziesz musiał ponownie wykonac procedurę rejestracji sprawdzenia wpisów bibliograficznych.

# plugins.generic.crossrefReferenceLinking.description.requirements
source: This plugin requires an article to be assigned a Crossref DOI and this DOI must be deposited with Crossref from within OJS. Article references can be provided in the References section in the Publication tab of each submission.
de_de: Dieses Plugin erfordert, dass Crossref DOI innerhalb OJS an Artikel vergeben und registriert werden. Literaturlisten und Referenzen können im Tab "veröffentlichung -> "Literatur" einer Einreichung eingegeben werden.
fr_fr: Ce plugin exige qu'un article se voie attribuer un DOI Crossref et que ce DOI soit déposé auprès de Crossref à partir d'OJS. Les références des articles peuvent être fournies dans la section Références de l'onglet Publication de chaque soumission.
it_it: Questo plugin richiede che ad un articolo sia assegnato un DOI Crossref e che questo DOI sia depositato presso Crossref dall'interno di OJS. I riferimenti dell'articolo possono essere forniti nella sezione Riferimenti bibliografici nella scheda Pubblicazione di ogni sottomissione.
pl_pl: Ta wtyczka wymaga przypisania artykułu w Crossref DOI. DOI musi zostać założony w Crossref z poziomu OJS. Bibliografię do artykułów można podać w sekcji Metadane kazdego artykułu.

# plugins.generic.crossrefReferenceLinking.settings.form.crossrefSettings
source: Crossref XML Export Plugin Settings
de_de: Einstellungen des Crossref XML Export Plugin
es: Configuración del módulo de exportación XML Crossref
fr_fr: Paramètres du plugin d'exportation Crossref XML
it_it: Impostazioni del plugin di esportazione XML di Crossref
pl_pl: Wtyczka exportu do Crossref- Ustawienia

# plugins.generic.crossrefReferenceLinking.settings.form.crossrefSettings.required
source: Crossref username and password must be configured:
de_de: Crossref Benutzername und Passwort müssen gesetzt werden:
es: El nombre de usuario y contraseña Crossref deben estar configurados:
fr_fr: Le nom d'utilisateur et le mot de passe de Crossref doivent être configurés :
it_it: Il nome utente e la password di Crossref devono essere configurati:
pl_pl: Login i hasło do Crossref musi być skonfigurowane:

# plugins.generic.crossrefReferenceLinking.settings.form.submissionSettings
source: Submission Metadata Settings
de_de: Einstellunegn der Einreichungs-Metadaten
es: Configuración de metadatos de envío
fr_fr: Paramètres des métadonnées de la soumission
it_it: Impostazioni dei metadati della sottomissione
pl_pl: Ustawienia Metadanych zgłoszenia

source: Submission references metadata must be enabled:
de_de: Literatur der Einreichung müssen aktiviert sein:
es: Los metadatos de referencias de envío deben estar habilitados:
fr_fr: Les métadonnées de références de la soumission doivent être activées :
it_it: I metadati dei riferimenti della sottomissione devono essere abilitati
pl_pl: Metadane bibliografii zgłoszenia powinny być włączone:

# plugins.generic.crossrefReferenceLinking.settings.form.requirements.ok
source: You're all set up!
de_de: Alles gut jetzt!
es: Ya está todo listo!
fr_fr: Tout est prêt !
it_it: È tutto pronto!
pl_pl: Wszystkie ustawienia w porządku!

# plugins.generic.crossrefReferenceLinking.citationsFormActionName
source: Check Crossref DOIs
de_de: Crossref DOIs überprüfen
es: Verificar DOIs en Crossref
fr_fr: Vérifier les DOI de Crossref
it_it: Controllare i DOI di Crossref
pl_pl: Sprawdź DOI w Crossref

# plugins.generic.crossrefReferenceLinking.senderTask.name
source: CrossrefReferenceLinking automatic registration task
de_de: Automatische CrossrefReferenceLinking Registrierungsaufgabe
es: Tarea de registro automático CrossrefReferenceLinking
fr_fr: Tâche d'enregistrement automatique CrossrefReferenceLinking
it_it: Compito di registrazione automatica di CrossrefReferenceLinking
pl_pl: CrossrefReferenceLinking zadanie automatycznej rejestracji
